РП/src/DataProcessors/ВыполнениеМаршрутныхЛистов/ВыполнениеМаршрутныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыполнениеМаршрутныхЛистов</name>
</mdclass:DataProcessor>

РП/src/Enums/СтатусыМаршрутныхЛистовПроизводства/СтатусыМаршрутныхЛистовПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМаршрутныхЛистовПроизводства</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СостоянияРасписанияРабочихЦентров/СостоянияРасписанияРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРасписанияРабочихЦентров</name>
  <enumValues>
    <name>НеСформировано</name>
  </enumValues>
  <enumValues>
    <name>СформированоЧастично</name>
  </enumValues>
  <enumValues>
    <name>СформированоПолностью</name>
  </enumValues>
  <enumValues>
    <name>Сформировано</name>
  </enumValues>
  <enumValues>
    <name>Некорректное</name>
  </enumValues>
  <enumValues>
    <name>НеАктуально</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ТехнологическиеОперации/ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеОперации</name>
  <owners>Catalog.МаршрутныеКарты</owners>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитВложенныйМаршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложенныйМаршрут</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучноеЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВспомогательныеРабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/DataProcessors/ВыполнениеМаршрутныхЛистов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СменноСуточноеЗадание") Тогда
		
		ТабличныйДокумент = СформироватьСменноСуточноеЗадание(ПараметрыПечати, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
									КоллекцияПечатныхФорм, 
									"СменноСуточноеЗадание", 
									НСтр("ru='Сменно-суточное задание';uk='Змінно-добове завдання'"), 
									ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьСменноСуточноеЗадание(ПараметрыПечати, ОбъектыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ВыполнениеМаршрутныхЛистов.ПФ_MXL_СменноСуточноеЗадание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыЗаданий.ДатаЗадания КАК НачалоЗадания,
	|	КОНЕЦПЕРИОДА(ДатыЗаданий.ДатаЗадания, ДЕНЬ) КАК ОкончаниеЗадания
	|ПОМЕСТИТЬ ДатыЗаданий
	|ИЗ
	|	&ДатыЗаданий КАК ДатыЗаданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	МаршрутныйЛистПроизводства.Ссылка КАК Ссылка,
	|	МаршрутныйЛистПроизводстваОперации.КлючСвязи КАК КлючСвязиОперации,
	|	МаршрутныйЛистПроизводстваТрудозатраты.Бригада КАК Бригада,
	|	ДатыЗаданий.НачалоЗадания КАК ДатаЗадания
	|ПОМЕСТИТЬ ВыборкаМаршрутныхЛистов
	|ИЗ
	|	Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛистПроизводства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.Операции КАК МаршрутныйЛистПроизводстваОперации
	|		ПО (МаршрутныйЛистПроизводстваОперации.Ссылка = МаршрутныйЛистПроизводства.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыЗаданий КАК ДатыЗаданий
	|		ПО (ДатыЗаданий.ОкончаниеЗадания >= МаршрутныйЛистПроизводстваОперации.Начало)
	|			И (ДатыЗаданий.НачалоЗадания <= МаршрутныйЛистПроизводстваОперации.Окончание)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.Трудозатраты КАК МаршрутныйЛистПроизводстваТрудозатраты
	|		ПО (МаршрутныйЛистПроизводстваТрудозатраты.Ссылка = МаршрутныйЛистПроизводстваОперации.Ссылка)
	|			И (МаршрутныйЛистПроизводстваТрудозатраты.КлючСвязиОперации = МаршрутныйЛистПроизводстваОперации.КлючСвязи)
	|			И (МаршрутныйЛистПроизводстваТрудозатраты.Бригада В (&Бригады))
	|ГДЕ
	|	МаршрутныйЛистПроизводства.Проведен
	|	И МаршрутныйЛистПроизводства.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.КВыполнению),
	|											ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.Выполняется),
	|											ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.Выполнен))
	|	И МаршрутныйЛистПроизводства.СостояниеРасписания = ЗНАЧЕНИЕ(Перечисление.СостоянияРасписанияРабочихЦентров.Сформировано)
	|	И МаршрутныйЛистПроизводства.Подразделение = &Подразделение
	|	И (&РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
	|			ИЛИ МаршрутныйЛистПроизводстваОперации.РабочийЦентрПоРасписанию В ИЕРАРХИИ (&РабочийЦентр))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыборкаМаршрутныхЛистов.ДатаЗадания КАК ДатаЗадания,
	|	ВыборкаМаршрутныхЛистов.Бригада КАК Бригада,
	|	МаршрутныйЛистПроизводства.Ссылка КАК МаршрутныйЛист,
	|	МаршрутныйЛистПроизводства.Номер КАК Номер,
	|	МаршрутныйЛистПроизводства.Дата КАК Дата,
	|	МаршрутныйЛистПроизводства.Запланировано КАК Запланировано,
	|	МаршрутныйЛистПроизводства.Этап.Представление КАК Этап,
	|	МаршрутныйЛистПроизводства.Спецификация.Представление КАК Спецификация,
	|	МаршрутныйЛистПроизводства.Спецификация.МногоэтапныйПроизводственныйПроцесс КАК МногоэтапныйПроизводственныйПроцесс,
	|	ВЫБОР
	|		КОГДА МаршрутныйЛистПроизводстваОперации.Операция ССЫЛКА Справочник.ТехнологическиеОперации
	|			ТОГДА ВЫРАЗИТЬ(МаршрутныйЛистПроизводстваОперации.Операция КАК Справочник.ТехнологическиеОперации).Представление
	|		ИНАЧЕ МаршрутныйЛистПроизводстваОперации.Операция
	|	КОНЕЦ КАК Операция,
	|	МаршрутныйЛистПроизводстваОперации.РабочийЦентрПоРасписанию.Представление КАК РабочийЦентр,
	|	МаршрутныйЛистПроизводстваОперации.Начало КАК Начало,
	|	МаршрутныйЛистПроизводстваОперации.Окончание КАК Окончание
	|ИЗ
	|	ВыборкаМаршрутныхЛистов КАК ВыборкаМаршрутныхЛистов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства КАК МаршрутныйЛистПроизводства
	|		ПО (МаршрутныйЛистПроизводства.Ссылка = ВыборкаМаршрутныхЛистов.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.Операции КАК МаршрутныйЛистПроизводстваОперации
	|		ПО (МаршрутныйЛистПроизводстваОперации.Ссылка = ВыборкаМаршрутныхЛистов.Ссылка)
	|			И (МаршрутныйЛистПроизводстваОперации.КлючСвязи = ВыборкаМаршрутныхЛистов.КлючСвязиОперации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Бригада,
	|	ДатаЗадания,
	|	Начало
	|ИТОГИ ПО
	|	Бригада,
	|	ДатаЗадания";
	
	ДатыЗаданий = Новый ТаблицаЗначений;
	ДатыЗаданий.Колонки.Добавить("ДатаЗадания", Новый ОписаниеТипов("Дата"));
	Для каждого ДатаЗадания Из ПараметрыПечати.ДатыЗаданий Цикл
		НоваяСтока = ДатыЗаданий.Добавить();
		НоваяСтока.ДатаЗадания = ДатаЗадания;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Подразделение",  ПараметрыПечати.Подразделение);
	Запрос.УстановитьПараметр("РабочийЦентр",   ПараметрыПечати.РабочийЦентр);
	Запрос.УстановитьПараметр("ДатыЗаданий",    ДатыЗаданий);
	Запрос.УстановитьПараметр("ТекущийДень",    НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Бригады",        ПараметрыПечати.Бригады);
	
	Результат = Запрос.Выполнить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СменноСуточноеЗадание";
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
	
	ВыборкаБригады = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЗаданияВыдал = Пользователи.ТекущийПользователь();
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаБригады.Следующий() Цикл
		
		ВыборкаДатыЗаданий = ВыборкаБригады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДатыЗаданий.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент    = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Выводим общие реквизиты шапки
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
																		НСтр("ru='Сменно-суточное задание на %1';uk='Змінно-добове завдання на %1'"),
																		Формат(ВыборкаДатыЗаданий.ДатаЗадания, "ДЛФ=D"));
																		
			ОбластьЗаголовок.Параметры.Бригада = ВыборкаБригады.Бригада;
			ОбластьЗаголовок.Параметры.Выдал   = ЗаданияВыдал;
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			СсылкаОбластьПечати = ОбластьЗаголовок.Параметры.ТекстЗаголовка + " (" + ОбластьЗаголовок.Параметры.Бригада + ")";
									
			НомерСтраницы = 1;
			
			// Создаем массив для проверки вывода
			МассивВыводимыхОбластей = Новый Массив;
			
			НомерСтроки = 0;
			
			СтрокаОперация = ВыборкаДатыЗаданий.Выбрать();
			Пока СтрокаОперация.Следующий() Цикл
				
				НомерСтроки = НомерСтроки + 1;
				
				ОбластьМакета.Параметры.Заполнить(СтрокаОперация);
				
				НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СтрокаОперация.Номер, Ложь, Истина);
				ОбластьМакета.Параметры.МаршрутныйЛистСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
																	НСтр("ru='№%1 от %2';uk='№%1 від %2'"), 
																	НомерНаПечать, 
																	Формат(СтрокаОперация.Дата, "ДЛФ=D"));
																	
				СпецификацияСтрока = СтрокаОперация.Спецификация;
				Если СтрокаОперация.МногоэтапныйПроизводственныйПроцесс Тогда
					СпецификацияСтрока = СпецификацияСтрока + ", " + СтрокаОперация.Этап;
				КонецЕсли;
				ОбластьМакета.Параметры.СпецификацияСтрока = СпецификацияСтрока;
				ОбластьМакета.Параметры.НомерСтроки = Формат(НомерСтроки, "ЧГ=");
				
				Если НомерСтроки = 1 Тогда
				
					ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
					
				Иначе
				
					МассивВыводимыхОбластей.Очистить();
					МассивВыводимыхОбластей.Добавить(ОбластьМакета);
					
					Если НомерСтроки <> 1 И Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
						
						НомерСтраницы = НомерСтраницы + 1;
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
						
					КонецЕсли;
					
				КонецЕсли;
					
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
		
			ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаОбластьПечати);
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти
 
#КонецОбласти

#КонецЕсли
